{
  "module": "keras",
  "class_name": "Sequential",
  "config": {
    "name": "sequential",
    "trainable": true,
    "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": { "name": "float32" },
      "registered_name": null
    },
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "InputLayer",
        "config": {
          "batch_shape": [null, 224, 224, 3],
          "dtype": "float32",
          "sparse": false,
          "name": "input_layer"
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Lambda",
        "config": {
          "name": "lambda",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "function": {
            "class_name": "__lambda__",
            "config": {
              "code": "4wEAAAAAAAAAAAAAAAMAAAADAAAA8xgAAACXAHQBAAAAAAAAAAB8AKsBAAAAAAAAUwApAU4pAdoK\nYmFzZV9tb2RlbCkB2gF4cwEAAAAg+mFDOi9Vc2Vycy90YW52aS9PbmVEcml2ZS9EZXNrdG9wL3B5\ndGhvbi90cmFpbmdlc3R1cmVzL1RyYWluLUhhbmRzLUdlc3R1cmVzLW1haW4vZ2VuZXJhdGluZ21v\nZGVsLnB5+gg8bGFtYmRhPnIFAAAADwAAAHMKAAAAgACkWrABo12AAPMAAAAA\n",
              "defaults": null,
              "closure": null
            }
          },
          "arguments": {}
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 224, 224, 3] }
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "units": 1,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 1280] }
      }
    ],
    "build_input_shape": [null, 224, 224, 3]
  },
  "registered_name": null,
  "build_config": { "input_shape": [null, 224, 224, 3] },
  "compile_config": {
    "optimizer": {
      "module": "keras.optimizers",
      "class_name": "Adam",
      "config": {
        "name": "adam",
        "learning_rate": 0.0010000000474974513,
        "weight_decay": null,
        "clipnorm": null,
        "global_clipnorm": null,
        "clipvalue": null,
        "use_ema": false,
        "ema_momentum": 0.99,
        "ema_overwrite_frequency": null,
        "loss_scale_factor": null,
        "gradient_accumulation_steps": null,
        "beta_1": 0.9,
        "beta_2": 0.999,
        "epsilon": 1e-7,
        "amsgrad": false
      },
      "registered_name": null
    },
    "loss": "categorical_crossentropy",
    "loss_weights": null,
    "metrics": ["accuracy"],
    "weighted_metrics": null,
    "run_eagerly": false,
    "steps_per_execution": 1,
    "jit_compile": false
  }
}
